[
    {
      "id": 1,
      "estate_title": "Luxury Penthouse with Panoramic City Views",
      "segment_name": "Penthouse",
      "img_url":"https://i.ibb.co/fp5zRN2/penthouse-1.jpg",
      "description": "Experience luxury living at its finest in this stunning penthouse boasting panoramic city views. With modern design and top-notch amenities, this penthouse offers an unparalleled lifestyle.",
      "price": "$3,500,000",
      "status": "sale",
      "area": "3500 sq ft",
      "location": "Downtown Skyline",
      "facilities": ["Spacious living room", "Private rooftop terrace", "Gourmet kitchen"],
      "details_description": "Perched high above the city, this luxurious penthouse epitomizes sophistication and elegance. Floor-to-ceiling windows flood the interior with natural light, while the expansive living space is perfect for entertaining. The master suite offers a peaceful retreat, complete with a spa-like ensuite bathroom. With premium finishes and state-of-the-art appliances, this penthouse is a true urban oasis."
    },
    {
      "id": 2,
      "estate_title": "Modern Penthouse with Skyline Views",
      "segment_name": "Penthouse",
      "img_url":"https://i.ibb.co/yFxpzd9/penthouse-2.jpg",
      "description": "Discover contemporary luxury living in this modern penthouse with breathtaking skyline views. With sleek design and high-end finishes, this penthouse is the epitome of urban chic.",
      "price": "$2,800,000",
      "status": "sale",
      "area": "3000 sq ft",
      "location": "City Center",
      "facilities": ["Open-concept living space", "Private balcony", "Designer kitchen"],
      "details_description": "This sleek penthouse offers a seamless blend of style and functionality. The spacious living area features high ceilings and designer finishes, while the floor-to-ceiling windows frame stunning city vistas. The gourmet kitchen is equipped with top-of-the-line appliances, making it a chef's dream. With a private balcony for outdoor relaxation and entertaining, this penthouse is perfect for those seeking the ultimate urban retreat."
    },
    {
      "id": 3,
      "estate_title": "Beachfront Villa with Private Access",
      "segment_name": "Beach front properties",
      "img_url":"https://i.ibb.co/sPv3M7M/beach-1.jpg",
      "description": "Escape to paradise in this exquisite beachfront villa offering direct access to pristine sandy shores. With luxurious amenities and breathtaking ocean views, this villa is a dream coastal retreat.",
      "price": "$4,200,000",
      "status": "sale",
      "area": "5000 sq ft",
      "location": "Tropical Paradise",
      "facilities": ["Private beach access", "Infinity pool", "Outdoor dining area"],
      "details_description": "Nestled along the coastline, this beachfront villa offers the ultimate in luxury living. The spacious interiors are elegantly appointed with high-end furnishings and custom finishes. Floor-to-ceiling windows showcase panoramic ocean views, while the outdoor oasis features a sparkling infinity pool and lush landscaped gardens. With direct access to the beach, this villa is a serene haven for relaxation and entertainment."
    },
    {
      "id": 4,
      "estate_title": "Seaside Retreat with Spectacular Views",
      "segment_name": "Beach front properties",
      "img_url":"https://i.ibb.co/HXqMsXv/beach-2.jpg",
      "description": "Experience coastal living at its finest in this stunning seaside retreat. Perched on the water's edge, this property offers unparalleled views and luxurious amenities.",
      "price": "$3,800,000",
      "status": "sale",
      "area": "4500 sq ft",
      "location": "Oceanfront Haven",
      "facilities": ["Oceanfront terrace", "Private beach cabana", "Outdoor kitchen"],
      "details_description": "This seaside retreat is a sanctuary of luxury and tranquility. The expansive living spaces are designed for both relaxation and entertainment, with seamless indoor-outdoor flow. Panoramic ocean views can be enjoyed from every room, while the outdoor terrace is perfect for al fresco dining and lounging. With a private beach cabana and direct access to the shore, this property offers the ultimate coastal lifestyle."
    },
    {
      "id": 5,
      "estate_title": "Luxury Resort Escape with Five-Star Amenities",
      "segment_name": "Resorts",
      "img_url":"https://i.ibb.co/fnsr5v4/resort-1.jpg",
      "description": "Indulge in a luxury resort experience like no other at this exclusive retreat. Set amidst pristine landscapes, this resort offers unparalleled amenities and personalized service.",
      "price": "$800 per night",
      "status": "rent",
      "area": "6000 sq ft",
      "location": "Exotic Island Paradise",
      "facilities": ["Spa and wellness center", "Private beachfront villas", "Fine dining restaurants"],
      "details_description": "Escape to paradise at this luxurious resort, where every detail is designed to ensure a memorable stay. From pampering spa treatments to gourmet dining options, guests are treated to the finest in hospitality. The spacious beachfront villas feature elegant decor and modern amenities, offering a peaceful retreat amidst breathtaking natural beauty."
    },
    {
      "id": 6,
      "estate_title": "Tropical Resort Oasis with Private Villas",
      "segment_name": "Resorts",
      "img_url":"https://i.ibb.co/TvYpgXp/resort-2.jpg",
      "description": "Experience tropical paradise in this secluded resort oasis offering private villas and lush surroundings. With world-class amenities and personalized service, this resort is the ultimate getaway.",
      "price": "$1,200 per night",
      "status": "rent",
      "area": "5500 sq ft",
      "location": "Island Hideaway",
      "facilities": ["Infinity-edge pool", "Poolside cabanas", "Beachside bar"],
      "details_description": "Nestled on a pristine island, this tropical resort offers a haven of relaxation and luxury. The private villas are elegantly appointed with modern furnishings and tropical accents, creating a tranquil retreat for guests. Whether lounging by the infinity pool or enjoying a cocktail at the beachside bar, every moment at this resort is filled with blissful indulgence."
    },
    {
      "id": 7,
      "estate_title": "Modern Villa with Scenic Views",
      "segment_name": "Villa",
      "img_url": "https://i.ibb.co/KVVtH2D/villa-1.jpg",
      "description": "Discover modern luxury living in this sleek villa boasting scenic views and contemporary design. With spacious interiors and premium amenities, this villa offers the perfect blend of comfort and style.",
      "price": "$1,600,000",
      "status": "sale",
      "area": "4000 sq ft",
      "location": "Hillside Retreat",
      "facilities": ["Outdoor swimming pool", "Landscaped gardens", "Home theater"],
      "details_description": "Perched atop a hillside, this modern villa offers sweeping views of the surrounding landscape. The open-concept living area is flooded with natural light, creating a warm and inviting atmosphere. The outdoor space features a sparkling swimming pool and lush gardens, perfect for outdoor entertaining and relaxation. With luxurious finishes and state-of-the-art amenities, this villa is a true retreat from the ordinary."
    },
    {
      "id": 8,
      "estate_title": "Contemporary Villa with Mountain Views",
      "segment_name": "Villa",
      "img_url": "https://i.ibb.co/YkrcGff/villa-2.jpg",
      "description": "Escape to tranquility in this contemporary villa offering breathtaking mountain views and luxurious amenities. With sleek design and expansive living spaces, this villa is a modern oasis.",
      "price": "$1,400,000",
      "status": "sale",
      "area": "3800 sq ft",
      "location": "Mountain Retreat",
      "facilities": ["Outdoor hot tub", "Fitness center", "Home office"],
      "details_description": "Surrounded by natural beauty, this contemporary villa offers a peaceful retreat from the hustle and bustle of everyday life. The spacious interiors are thoughtfully designed for both comfort and style, with high-end finishes and designer touches throughout. Whether relaxing in the outdoor hot tub or working out in the fitness center, every moment spent in this villa is filled with relaxation and rejuvenation."
    },
    {
      "id": 9,
      "estate_title": "Stately Mansion with Timeless Elegance",
      "segment_name": "Mansion",
      "img_url": "https://i.ibb.co/zNmc3Tp/mansion-1.jpg",
      "description": "Step into luxury with this stately mansion exuding timeless elegance and sophistication. Set within expansive grounds, this property offers unparalleled grandeur and style.",
      "price": "$7,500,000",
      "status": "sale",
      "area": "12000 sq ft",
      "location": "Historic Estate",
      "facilities": ["Indoor swimming pool", "Tennis court", "Home theater"],
      "details_description": "From the grand entrance to the meticulously manicured gardens, every aspect of this mansion speaks to opulence and refinement. The interiors feature exquisite architectural details and luxurious finishes, creating an atmosphere of timeless elegance. With a range of amenities including an indoor swimming pool, tennis court, and home theater, this mansion offers the ultimate in luxury living."
    }
  ]